blog-posts/2007-10-02-planner-appt.org
#+TITLE: planner-appt

October 2nd, 2007 -
[[http://sachachua.com/blog/p/4379][http://sachachua.com/blog/p/4379]]

Now that I've taken a closer look at it, I can see that planner-appt's
 much cooler than the little hacks I'd been using to keep track of my
 schedule. I'm still not sure if I need a separate schedule section,
 because I've gotten used to managing my appointments in my task list.
 It's nice to know that the option is there, though, and I like how
 color-coding makes it easy to see which appointments are past and
 which ones are coming up.

Here's my config for planner-appt.el:

#+BEGIN_EXAMPLE
    ;;;_+ Appointments
    (require 'planner-appt)
    (planner-appt-use-tasks-and-schedule)
    (planner-appt-insinuate)
    (setq planner-appt-update-appts-on-save-flag t)
    (setq planner-appt-sort-schedule-on-update-flag t)
    (setq planner-appt-schedule-cyclic-behavior 'future)
    (setq planner-appt-task-use-appointments-section-flag t)
#+END_EXAMPLE

I wonder how I can go about exporting my appointments... <muse>

Random Emacs symbol: x-uses-old-gtk-dialog -- Function: Return t if the
old Gtk+ file selection dialog is used.
